src/Reports/ПоискМатериаловПоКорневымХарактеристикам/ПоискМатериаловПоКорневымХарактеристикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПоискМатериаловПоКорневымХарактеристикам</name>
</mdclass:Report>

src/InformationRegisters/КорневыеХарактеристикиМатериала/КорневыеХарактеристикиМатериала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КорневыеХарактеристикиМатериала</name>
  <resources>
    <name>Значение1</name>
    <type>
      <types>Characteristic.ПараметрыМатериалов</types>
    </type>
  </resources>
  <resources>
    <name>Значение2</name>
    <type>
      <types>Characteristic.ПараметрыМатериалов</types>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрМатериала</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыМатериалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ПоискМатериаловПоКорневымХарактеристикам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ВидМатериалаПриИзмененииНаСервере()
ТаблицаКорневыхХарактеристик.Очистить();
ТаблицаМатериалов.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныПараметровМатериалов.ПараметрМатериала КАК ПараметрМатериала
	|ИЗ
	|	Справочник.ШаблоныПараметровМатериалов КАК ШаблоныПараметровМатериалов
	|ГДЕ
	|	ШаблоныПараметровМатериалов.Владелец = &Владелец";
Запрос.УстановитьПараметр("Владелец", ВидМатериала);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаКорневыхХарактеристик.Добавить();
	ТЧ.Параметр = ВыборкаДетальныеЗаписи.ПараметрМатериала;
	ТЧ.ТипЗначения = ВыборкаДетальныеЗаписи.ПараметрМатериала.ТипЗначения;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидМатериалаПриИзменении(Элемент)
ВидМатериалаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиМатериалыНаСервере()
ТаблицаМатериалов.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорневыеХарактеристикиМатериала.Материал КАК Материал,
	|	КорневыеХарактеристикиМатериала.ПараметрМатериала КАК ПараметрМатериала,
	|	КорневыеХарактеристикиМатериала.Значение1 КАК Значение1,
	|	КорневыеХарактеристикиМатериала.Значение2 КАК Значение2
	|ИЗ
	|	РегистрСведений.КорневыеХарактеристикиМатериала КАК КорневыеХарактеристикиМатериала
	|ГДЕ
	|	КорневыеХарактеристикиМатериала.Материал.ВидМатериала = &ВидМатериала
	|ИТОГИ ПО
	|	Материал,
	|	ПараметрМатериала";
	Если Не ГруппаМатериалов.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И Материалы.Родитель В ИЕРАРХИИ(&ГруппаМатериалов)";
	Запрос.УстановитьПараметр("ГруппаМатериалов", ГруппаМатериалов);
	КонецЕсли; 
Запрос.УстановитьПараметр("ВидМатериала", ВидМатериала);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМатериалы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМатериалы.Следующий() Цикл
	флУдовлетворяет = Истина;
	ВыборкаПараметры = ВыборкаМатериалы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для каждого ТЧ Из ТаблицаКорневыхХарактеристик Цикл	
			Если ТЧ.Пометка Тогда
			ВыборкаПараметры.Сбросить();
				Если ВыборкаПараметры.НайтиСледующий(Новый Структура("ПараметрМатериала",ТЧ.Параметр)) Тогда
				ВыборкаЗначения = ВыборкаПараметры.Выбрать();
					Пока ВыборкаЗначения.Следующий() Цикл	
						Если ЗначениеЗаполнено(ТЧ.Значение1) Тогда
							//Если  Тогда
							//
							//	
							//
							//КонецЕсли; 	
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура НайтиМатериалы(Команда)
НайтиМатериалыНаСервере();
КонецПроцедуры
